[Killed] ArithmeticOperator
main/components/Commons/CommonsForm.js:75:23
     const testid = "CommonsForm";
     const curr = new Date();
     const today = toLocalISOString(curr).split('T')[0];
-    const currMonth = curr.getMonth() % 12;
+    const currMonth = curr.getMonth() * 12;
     const nextMonth = toLocalISOString(new Date(curr.getFullYear(), currMonth + 1, curr.getDate())).split('T')[0];
     const DefaultVals = {
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(2024-06-18)

Expected the element to have value:
  2024-06-18
Received:
  2028-02-18

[Killed] ArithmeticOperator
main/components/Commons/CommonsForm.js:76:69
     const curr = new Date();
     const today = toLocalISOString(curr).split('T')[0];
     const currMonth = curr.getMonth() % 12;
-    const nextMonth = toLocalISOString(new Date(curr.getFullYear(), currMonth + 1, curr.getDate())).split('T')[0];
+    const nextMonth = toLocalISOString(new Date(curr.getFullYear(), currMonth - 1, curr.getDate())).split('T')[0];
     const DefaultVals = {
         name: "",
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(2024-06-18)

Expected the element to have value:
  2024-06-18
Received:
  2024-04-18
