[Killed] BlockStatement
main/components/Utils/DateConversion.js:1:43
-export const toLocalISOString = (date) => {
-    const pad = (num) => String(num).padStart(2, '0');
-    const datePart = `${date.getFullYear()}-${pad(date.getMonth() + 1)}-${pad(date.getDate())}`;
-    const timePart = `${pad(date.getHours())}:${pad(date.getMinutes())}:${pad(date.getSeconds())}.${pad(date.getMilliseconds(), 3)}`;
-    const offset = calculateTimezoneOffset(date);
-    const sign = calculateSign(offset);
-    const hours = calculateHours(offset);
-    const minutes = calculateMinutes(offset);
-    const timezone = `${sign}${hours}:${minutes}`;
-    return `${datePart}T${timePart}${timezone}`;
-};
+export const toLocalISOString = (date) => {};
 
 export const calculateTimezoneOffset = (date) => -date.getTimezoneOffset();
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] ArrowFunction
main/components/Utils/DateConversion.js:2:17
 export const toLocalISOString = (date) => {
-    const pad = (num) => String(num).padStart(2, '0');
+    const pad = () => undefined;
     const datePart = `${date.getFullYear()}-${pad(date.getMonth() + 1)}-${pad(date.getDate())}`;
     const timePart = `${pad(date.getHours())}:${pad(date.getMinutes())}:${pad(date.getSeconds())}.${pad(date.getMilliseconds(), 3)}`;
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(2024-undefined-undefined)

Expected the element to have value:
  2024-undefined-undefined
Received:

[Killed] StringLiteral
main/components/Utils/DateConversion.js:2:50
 export const toLocalISOString = (date) => {
-    const pad = (num) => String(num).padStart(2, '0');
+    const pad = (num) => String(num).padStart(2, "");
     const datePart = `${date.getFullYear()}-${pad(date.getMonth() + 1)}-${pad(date.getDate())}`;
     const timePart = `${pad(date.getHours())}:${pad(date.getMinutes())}:${pad(date.getSeconds())}.${pad(date.getMilliseconds(), 3)}`;
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(2024-5-21)

Expected the element to have value:
  2024-5-21
Received:

[Killed] ArithmeticOperator
main/components/Utils/DateConversion.js:3:51
 export const toLocalISOString = (date) => {
     const pad = (num) => String(num).padStart(2, '0');
-    const datePart = `${date.getFullYear()}-${pad(date.getMonth() + 1)}-${pad(date.getDate())}`;
+    const datePart = `${date.getFullYear()}-${pad(date.getMonth() - 1)}-${pad(date.getDate())}`;
     const timePart = `${pad(date.getHours())}:${pad(date.getMinutes())}:${pad(date.getSeconds())}.${pad(date.getMilliseconds(), 3)}`;
     const offset = calculateTimezoneOffset(date);
killedBy: toLocalISOString correctly formats a date to local ISO string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2024-05-18T03:00:00.00-07:00"
Received: "2024-03-18T03:00:00.00-07:00"

[Killed] StringLiteral
main/components/Utils/DateConversion.js:4:22
 export const toLocalISOString = (date) => {
     const pad = (num) => String(num).padStart(2, '0');
     const datePart = `${date.getFullYear()}-${pad(date.getMonth() + 1)}-${pad(date.getDate())}`;
-    const timePart = `${pad(date.getHours())}:${pad(date.getMinutes())}:${pad(date.getSeconds())}.${pad(date.getMilliseconds(), 3)}`;
+    const timePart = ``;
     const offset = calculateTimezoneOffset(date);
     const sign = calculateSign(offset);
killedBy: toLocalISOString correctly formats a date to local ISO string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2024-05-18T03:00:00.00-07:00"
Received: "2024-05-18T-07:00"

[Killed] StringLiteral
main/components/Utils/DateConversion.js:10:12
     const hours = calculateHours(offset);
     const minutes = calculateMinutes(offset);
     const timezone = `${sign}${hours}:${minutes}`;
-    return `${datePart}T${timePart}${timezone}`;
+    return ``;
 };
 
killedBy: toLocalISOString correctly formats a date to local ISO string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2024-05-18T03:00:00.00-07:00"
Received: ""

[Killed] ArrowFunction
main/components/Utils/DateConversion.js:13:40
     return `${datePart}T${timePart}${timezone}`;
 };
 
-export const calculateTimezoneOffset = (date) => -date.getTimezoneOffset();
+export const calculateTimezoneOffset = () => undefined;
 
 export const calculateSign = (offset) => (offset >= 0) ? '+' : '-';
killedBy: Arithmetic Operator Functions correctly calculates the timezone offset
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -420
Received: undefined

[Killed] UnaryOperator
main/components/Utils/DateConversion.js:13:50
     return `${datePart}T${timePart}${timezone}`;
 };
 
-export const calculateTimezoneOffset = (date) => -date.getTimezoneOffset();
+export const calculateTimezoneOffset = (date) => +date.getTimezoneOffset();
 
 export const calculateSign = (offset) => (offset >= 0) ? '+' : '-';
killedBy: Arithmetic Operator Functions correctly calculates the timezone offset
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -420
Received: 420

[Killed] ConditionalExpression
main/components/Utils/DateConversion.js:15:43
 
 export const calculateTimezoneOffset = (date) => -date.getTimezoneOffset();
 
-export const calculateSign = (offset) => (offset >= 0) ? '+' : '-';
+export const calculateSign = (offset) => (true) ? '+' : '-';
 
 export const calculateHours = (offset) => {
killedBy: Arithmetic Operator Functions correctly calculates the sign for negative offset
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "-"
Received: "+"

[Killed] EqualityOperator
main/components/Utils/DateConversion.js:15:43
 
 export const calculateTimezoneOffset = (date) => -date.getTimezoneOffset();
 
-export const calculateSign = (offset) => (offset >= 0) ? '+' : '-';
+export const calculateSign = (offset) => (offset < 0) ? '+' : '-';
 
 export const calculateHours = (offset) => {
killedBy: Arithmetic Operator Functions correctly calculates the sign for positive offset
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "+"
Received: "-"

[Killed] BlockStatement
main/components/Utils/DateConversion.js:17:43
 
 export const calculateSign = (offset) => (offset >= 0) ? '+' : '-';
 
-export const calculateHours = (offset) => {
-  const pad = (num) => String(num).padStart(2, '0');
-  return pad(Math.floor(Math.abs(offset) / 60));
-};
+export const calculateHours = (offset) => {};
 
 export const calculateMinutes = (offset) => {
killedBy: Arithmetic Operator Functions correctly calculates hours for positive offset
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "05"
Received: undefined

[Killed] ArrowFunction
main/components/Utils/DateConversion.js:18:15
 export const calculateSign = (offset) => (offset >= 0) ? '+' : '-';
 
 export const calculateHours = (offset) => {
-  const pad = (num) => String(num).padStart(2, '0');
+  const pad = () => undefined;
   return pad(Math.floor(Math.abs(offset) / 60));
 };
killedBy: Arithmetic Operator Functions correctly calculates hours for positive offset
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "05"
Received: undefined

[Killed] ArithmeticOperator
main/components/Utils/DateConversion.js:19:25
 
 export const calculateHours = (offset) => {
   const pad = (num) => String(num).padStart(2, '0');
-  return pad(Math.floor(Math.abs(offset) / 60));
+  return pad(Math.floor(Math.abs(offset) * 60));
 };
 
killedBy: Arithmetic Operator Functions correctly calculates hours for positive offset
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "05"
Received: "18000"

[Killed] BlockStatement
main/components/Utils/DateConversion.js:22:45
   return pad(Math.floor(Math.abs(offset) / 60));
 };
 
-export const calculateMinutes = (offset) => {
-  const pad = (num) => String(num).padStart(2, '0');
-  return pad(Math.abs(offset) % 60);
-};
+export const calculateMinutes = (offset) => {};
 
 
killedBy: Arithmetic Operator Functions correctly calculates minutes for positive offset
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "00"
Received: undefined

[Killed] ArrowFunction
main/components/Utils/DateConversion.js:23:15
 };
 
 export const calculateMinutes = (offset) => {
-  const pad = (num) => String(num).padStart(2, '0');
+  const pad = () => undefined;
   return pad(Math.abs(offset) % 60);
 };
killedBy: Arithmetic Operator Functions correctly calculates minutes for positive offset
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "00"
Received: undefined

[Killed] ArithmeticOperator
main/components/Utils/DateConversion.js:24:14
 
 export const calculateMinutes = (offset) => {
   const pad = (num) => String(num).padStart(2, '0');
-  return pad(Math.abs(offset) % 60);
+  return pad(Math.abs(offset) * 60);
 };
 
killedBy: Arithmetic Operator Functions correctly calculates minutes for positive offset
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "00"
Received: "18000"

[Killed] BlockStatement
main/components/Utils/DateConversion.js:28:41
 };
 
 
-export const DateConversion = (curr) => {
-  const today = toLocalISOString(curr).split('T')[0];
-  const nextMonth = toLocalISOString(new Date(curr.getFullYear(), today.slice(5, 7) % 12, today.slice(8, 10))).split('T')[0];
-  
-  return [today, nextMonth];
-};
+export const DateConversion = (curr) => {};
killedBy: DateConversion should return the correct today date
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] StringLiteral
main/components/Utils/DateConversion.js:29:46
 
 
 export const DateConversion = (curr) => {
-  const today = toLocalISOString(curr).split('T')[0];
+  const today = toLocalISOString(curr).split("")[0];
   const nextMonth = toLocalISOString(new Date(curr.getFullYear(), today.slice(5, 7) % 12, today.slice(8, 10))).split('T')[0];
   
killedBy: DateConversion should return the correct today date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2024-05-21"
Received: "2"

[Killed] MethodExpression
main/components/Utils/DateConversion.js:30:91
 
 export const DateConversion = (curr) => {
   const today = toLocalISOString(curr).split('T')[0];
-  const nextMonth = toLocalISOString(new Date(curr.getFullYear(), today.slice(5, 7) % 12, today.slice(8, 10))).split('T')[0];
+  const nextMonth = toLocalISOString(new Date(curr.getFullYear(), today.slice(5, 7) % 12, today)).split('T')[0];
   
   return [today, nextMonth];
killedBy: DateConversion should return the correct today date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2024-06-21"
Received: "NaN-NaN-NaN"

[Killed] ArithmeticOperator
main/components/Utils/DateConversion.js:30:67
 
 export const DateConversion = (curr) => {
   const today = toLocalISOString(curr).split('T')[0];
-  const nextMonth = toLocalISOString(new Date(curr.getFullYear(), today.slice(5, 7) % 12, today.slice(8, 10))).split('T')[0];
+  const nextMonth = toLocalISOString(new Date(curr.getFullYear(), today.slice(5, 7) * 12, today.slice(8, 10))).split('T')[0];
   
   return [today, nextMonth];
killedBy: DateConversion should return the correct today date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2024-06-21"
Received: "2029-01-21"

[Killed] ArrayDeclaration
main/components/Utils/DateConversion.js:32:10
   const today = toLocalISOString(curr).split('T')[0];
   const nextMonth = toLocalISOString(new Date(curr.getFullYear(), today.slice(5, 7) % 12, today.slice(8, 10))).split('T')[0];
   
-  return [today, nextMonth];
+  return [];
 };
killedBy: DateConversion should return the correct today date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2024-05-21"
Received: undefined
