[Killed] BooleanLiteral
main/components/Announcement/AnnouncementCard.js:28:52
 
 const AnnouncementCard = ({ announcement }) => {
     const testIdPrefix = "announcementCard";
-    const [isCollapsed, setIsCollapsed] = useState(true);
+    const [isCollapsed, setIsCollapsed] = useState(false);
 
     if (!announcement || !announcement.startDate || isFutureDate(announcement.startDate)) {
killedBy: AnnouncementCard tests can toggle collapse state
statusReason: TestingLibraryElementError: Unable to find an element with the text: Show more. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card-body"
      style="font-size: 14px; border: 1px solid lightgrey; padding: 4px; border-radius: 10px;"
    >

[Killed] LogicalOperator
main/components/Announcement/AnnouncementCard.js:30:9
     const testIdPrefix = "announcementCard";
     const [isCollapsed, setIsCollapsed] = useState(true);
 
-    if (!announcement || !announcement.startDate || isFutureDate(announcement.startDate)) {
+    if (!announcement && !announcement.startDate || isFutureDate(announcement.startDate)) {
         return null;
     }
killedBy: AnnouncementCard tests handles announcement without start date
statusReason: TypeError: Cannot read properties of null (reading 'substring')

[Killed] BooleanLiteral
main/components/Announcement/AnnouncementCard.js:30:26
     const testIdPrefix = "announcementCard";
     const [isCollapsed, setIsCollapsed] = useState(true);
 
-    if (!announcement || !announcement.startDate || isFutureDate(announcement.startDate)) {
+    if (!announcement || announcement.startDate || isFutureDate(announcement.startDate)) {
         return null;
     }
killedBy: AnnouncementCard tests renders without crashing
statusReason: 
<body>
  <div />
</body>

[Killed] BlockStatement
main/components/Announcement/AnnouncementCard.js:38:34
         return null;
     }
 
-    const toggleCollapse = () => {
-        setIsCollapsed(!isCollapsed);
-    };
+    const toggleCollapse = () => {};
 
     return (
killedBy: AnnouncementCard tests can toggle collapse state
statusReason: TestingLibraryElementError: Unable to find an element with the text: Show less. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card-body"
      style="font-size: 14px; border: 1px solid lightgrey; padding: 4px; border-radius: 10px;"
    >

[Killed] BooleanLiteral
main/components/Announcement/AnnouncementCard.js:39:24
     }
 
     const toggleCollapse = () => {
-        setIsCollapsed(!isCollapsed);
+        setIsCollapsed(isCollapsed);
     };
 
killedBy: AnnouncementCard tests can toggle collapse state
statusReason: TestingLibraryElementError: Unable to find an element with the text: Show less. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card-body"
      style="font-size: 14px; border: 1px solid lightgrey; padding: 4px; border-radius: 10px;"
    >

[Killed] StringLiteral
main/components/Announcement/AnnouncementCard.js:66:44
                         <Button variant="link" onClick={toggleCollapse} style={
                             // Stryker disable next-line all : don't mutation test CSS
                             { fontSize: '11px', padding: '2px' }}>
-                            {isCollapsed ? 'Show more' : 'Show less'}
+                            {isCollapsed ? "" : 'Show less'}
                         </Button>
                     </Col>
killedBy: AnnouncementCard tests can toggle collapse state
statusReason: TestingLibraryElementError: Unable to find an element with the text: Show more. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card-body"
      style="font-size: 14px; border: 1px solid lightgrey; padding: 4px; border-radius: 10px;"
    >

[Killed] StringLiteral
main/components/Announcement/AnnouncementCard.js:66:58
                         <Button variant="link" onClick={toggleCollapse} style={
                             // Stryker disable next-line all : don't mutation test CSS
                             { fontSize: '11px', padding: '2px' }}>
-                            {isCollapsed ? 'Show more' : 'Show less'}
+                            {isCollapsed ? 'Show more' : ""}
                         </Button>
                     </Col>
killedBy: AnnouncementCard tests can toggle collapse state
statusReason: TestingLibraryElementError: Unable to find an element with the text: Show less. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card-body"
      style="font-size: 14px; border: 1px solid lightgrey; padding: 4px; border-radius: 10px;"
    >
