[Killed] BlockStatement
main/components/Announcement/AnnouncementCard.js:4:44
 import React, { } from "react";
 import { Card, Container, Row, Col } from "react-bootstrap";
 
-export function isFutureDate(startingDate) {
-    const curr = new Date();
-    const startYear = parseInt(startingDate);
-    const startMonth = parseInt(startingDate.substring(5,7));
-    const startDate = parseInt(startingDate.substring(8,10));
-    const currYear = curr.getFullYear();
-    const currMonth = curr.getMonth() + 1;
-    const currDate = curr.getDate();
-
-    if (startYear === currYear) {
-        if (startMonth === currMonth) {
-            return startDate > currDate;
-        } else {
-            // Stryker disable next-line all: mutation test unreasonable
-            return startMonth > currMonth;
-        }
-    } else {
-        // Stryker disable next-line all: mutation test unreasonable
-        return startYear > currYear;
-    }
-}
+export function isFutureDate(startingDate) {}
 
 const AnnouncementCard = ({ announcement }) => {
killedBy: AnnouncementCard tests isFutureDate function works correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
main/components/Announcement/AnnouncementCard.js:13:9
     const currMonth = curr.getMonth() + 1;
     const currDate = curr.getDate();
 
-    if (startYear === currYear) {
+    if (startYear !== currYear) {
         if (startMonth === currMonth) {
             return startDate > currDate;
killedBy: AnnouncementCard tests renders without crashing
statusReason: 
<body>
  <div />
</body>

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementCard.js:14:13
     const currDate = curr.getDate();
 
     if (startYear === currYear) {
-        if (startMonth === currMonth) {
+        if (true) {
             return startDate > currDate;
         } else {
killedBy: AnnouncementCard tests cannot show announcement with future start date - future month
statusReason: Error: expect(received).toBeNull()

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementCard.js:14:13
     const currDate = curr.getDate();
 
     if (startYear === currYear) {
-        if (startMonth === currMonth) {
+        if (false) {
             return startDate > currDate;
         } else {
killedBy: AnnouncementCard tests isFutureDate function works correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementCard.js:15:20
 
     if (startYear === currYear) {
         if (startMonth === currMonth) {
-            return startDate > currDate;
+            return false;
         } else {
             // Stryker disable next-line all: mutation test unreasonable
killedBy: AnnouncementCard tests isFutureDate function works correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
main/components/Announcement/AnnouncementCard.js:27:26
 }
 
 const AnnouncementCard = ({ announcement }) => {
-    const testIdPrefix = "announcementCard";
+    const testIdPrefix = "";
 
     if (!announcement || !announcement.startDate || isFutureDate(announcement.startDate)) {
killedBy: AnnouncementCard tests renders with correct data-testid
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="announcementCard-id-This is a test announcement for commons id 1. This one doesn't have an end date."]

<body>
  <div>
    <div
      class="card-body"
      style="font-size: 14px; border: 1px solid lightgrey; padding: 4px; border-radius: 10px; margin: 10px 0px;"
    >

[Killed] LogicalOperator
main/components/Announcement/AnnouncementCard.js:29:9
 const AnnouncementCard = ({ announcement }) => {
     const testIdPrefix = "announcementCard";
 
-    if (!announcement || !announcement.startDate || isFutureDate(announcement.startDate)) {
+    if ((!announcement || !announcement.startDate) && isFutureDate(announcement.startDate)) {
         return null;
     }
killedBy: AnnouncementCard tests cannot show announcement with future start date - future year
statusReason: Error: expect(received).toBeNull()

[Killed] BlockStatement
main/components/Announcement/AnnouncementCard.js:29:91
 const AnnouncementCard = ({ announcement }) => {
     const testIdPrefix = "announcementCard";
 
-    if (!announcement || !announcement.startDate || isFutureDate(announcement.startDate)) {
-        return null;
-    }
+    if (!announcement || !announcement.startDate || isFutureDate(announcement.startDate)) {}
 
     if (announcement.endDate && (!isFutureDate(announcement.endDate))) {
killedBy: AnnouncementCard tests cannot show announcement with future start date - future year
statusReason: Error: expect(received).toBeNull()

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementCard.js:33:9
         return null;
     }
 
-    if (announcement.endDate && (!isFutureDate(announcement.endDate))) {
+    if (true) {
         return null;
     }
killedBy: AnnouncementCard tests renders without crashing
statusReason: 
<body>
  <div />
</body>

[Killed] BlockStatement
main/components/Announcement/AnnouncementCard.js:33:72
         return null;
     }
 
-    if (announcement.endDate && (!isFutureDate(announcement.endDate))) {
-        return null;
-    }
+    if (announcement.endDate && (!isFutureDate(announcement.endDate))) {}
 
     return (
killedBy: AnnouncementCard tests cannot show announcement with past end date - past day
statusReason: Error: expect(received).toBeNull()
