[Killed] LogicalOperator
main/components/Commons/CommonsForm.js:80:26
         startingBalance: defaultValuesData?.startingBalance || "10000",
         cowPrice: defaultValuesData?.cowPrice || "100",
         milkPrice: defaultValuesData?.milkPrice || "1",
-        degradationRate: defaultValuesData?.degradationRate || 0.001,
+        degradationRate: defaultValuesData?.degradationRate && 0.001,
         carryingCapacity: defaultValuesData?.carryingCapacity || 100,
         startingDate: today,
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(0.001)

Expected the element to have value:
  0.001
Received:
  null

[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:81:27
         cowPrice: defaultValuesData?.cowPrice || "100",
         milkPrice: defaultValuesData?.milkPrice || "1",
         degradationRate: defaultValuesData?.degradationRate || 0.001,
-        carryingCapacity: defaultValuesData?.carryingCapacity || 100,
+        carryingCapacity: false,
         startingDate: today,
         lastDate: nextMonth,
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(100)

Expected the element to have value:
  100
Received:
  null

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:169:46
                             delay='100'
                         >
                             <Form.Control
-                                data-testid={`${testid}-cowPrice`}
+                                data-testid={``}
                                 id="cowPrice"
                                 type="number"
killedBy: CommonsForm tests has validation errors for required fields
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommonsForm-cowPrice"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:326:61
                     </Form.Control.Feedback>
                 </Form.Group>
                     
-                <Form.Group className="mb-5" style={{width: '300px', height: '50px'}} data-testid={`${testid}-r4`}>
+                <Form.Group className="mb-5" style={{width: "", height: '50px'}} data-testid={`${testid}-r4`}>
                     <Form.Label htmlFor="lastDate">Last Date</Form.Label>
                     <Form.Control
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- width: 300px;

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:326:78
                     </Form.Control.Feedback>
                 </Form.Group>
                     
-                <Form.Group className="mb-5" style={{width: '300px', height: '50px'}} data-testid={`${testid}-r4`}>
+                <Form.Group className="mb-5" style={{width: '300px', height: ""}} data-testid={`${testid}-r4`}>
                     <Form.Label htmlFor="lastDate">Last Date</Form.Label>
                     <Form.Control
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- height: 50px;
