[Killed] LogicalOperator
src/main/pages/PlayPage.js:178:22
             <BasicLayout>
                 <Container>
                     {!!currentUser && <CommonsPlay currentUser={currentUser} />}
-                    {!!commonsPlus && (
-                        <CommonsOverview
-                            commonsPlus={commonsPlus}
-                            currentUser={currentUser}
-                            announcements={announcements}
-                        />
-                    )}
+                    {!!commonsPlus || <CommonsOverview commonsPlus={commonsPlus} currentUser={currentUser} announcements={announcements} />}
                     <br />
                     {!!userCommons && !!commonsPlus && (
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'commons')
