[Killed] BlockStatement
src/main/pages/AdminListAnnouncementsPage.js:4:42
 import React from 'react';
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-const AdminListAnnouncementsPage = () => {
-    // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Admin List Announcements page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  )
-};
+const AdminListAnnouncementsPage = () => {};
 
 export default AdminListAnnouncementsPage;
killedBy: AdminListAnnouncementsPage tests Renders expected content
statusReason: Error: AdminListAnnouncementsPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
