[Killed] BlockStatement
src/main/pages/AdminJobsPage.js:212:21
 
 const jobsForTable = 
   Array.isArray(jobs) ?
-  jobs.map((job) => {
-    return {
-      id: job.id,
-      createdAt: job.createdAt,
-      updatedAt: job.updatedAt,
-      status: job.status,
-      log: job.log,
-    };
-  }) : 
+  jobs.map((job) => {}) : 
   // Stryker disable next-line ArrayDeclaration : no need to test what happens if [] is replaced with ["Stryker was here"]
   [];
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: expect(element).toBeInTheDocument()

element could not be found in the document
