[Survived] StringLiteral
main/components/Announcement/AnnouncementCard.js:38:87
     }
 
     return (
-        <Card.Body style={{ fontSize: "14px", border: "1px solid lightgrey", padding: "4px", borderRadius: "10px", margin: "10px 0" }}>
+        <Card.Body style={{ fontSize: "14px", border: "1px solid lightgrey", padding: "", borderRadius: "10px", margin: "10px 0" }}>
             <Container>
                 <Row>

[Survived] StringLiteral
main/components/Announcement/AnnouncementCard.js:38:39
     }
 
     return (
-        <Card.Body style={{ fontSize: "14px", border: "1px solid lightgrey", padding: "4px", borderRadius: "10px", margin: "10px 0" }}>
+        <Card.Body style={{ fontSize: "", border: "1px solid lightgrey", padding: "4px", borderRadius: "10px", margin: "10px 0" }}>
             <Container>
                 <Row>
