[Killed] ConditionalExpression
main/components/Commons/CommonsOverview.js:21:30
                 <Row>
                     <Col className="text-start">
                         <div data-testid="announcement-test">
-                            {announcements && announcements.length > 0 ? (
+                            {true ? (
                                 announcements.map((announcement, index) => (
                                     <AnnouncementCard key={index} announcement={announcement} />
killedBy: CommonsOverview tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] LogicalOperator
main/components/Commons/CommonsOverview.js:21:30
                 <Row>
                     <Col className="text-start">
                         <div data-testid="announcement-test">
-                            {announcements && announcements.length > 0 ? (
+                            {announcements || announcements.length > 0 ? (
                                 announcements.map((announcement, index) => (
                                     <AnnouncementCard key={index} announcement={announcement} />
killedBy: CommonsOverview tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'length')
