[Killed] EqualityOperator
main/components/Commons/CommonsCard.js:16:20
 
     if (startYear === currYear) {
         if (startMonth === currMonth) {
-            return startDate > currDate;
+            return startDate >= currDate;
         } else {
             // Stryker disable next-line all: mutation test unreasonable
killedBy: CommonsCard tests can join commons with current date
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
main/components/Commons/CommonsCard.js:38:22
                 <Row>
                     <Col sx={4} data-testid={`${testIdPrefix}-id-${commons.id}`}>{commons.id}</Col>
                     <Col sx={4} data-testid={`${testIdPrefix}-name-${commons.id}`}>{commons.name}</Col>
-                    {buttonText != null &&
+                    {true &&
                         <Col sm={4}>
                             <Button
killedBy: CommonsList tests renders no button when button text is null
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Unable to find an element"

Received function did not throw

[Killed] ConditionalExpression
main/components/Commons/CommonsCard.js:45:41
                                 size="sm"
                                 className="mx-4"
                                 onClick={() => {
-                                    if (buttonText === "Join" && isFutureDate(commons.startingDate)) {
+                                    if (true) {
                                         // Stryker disable next-line all: unable to read alert text in tests
killedBy: HomePage tests Redirects to the PlayPage when you click visit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/play/1"

Number of calls: 0

<html>
  <head />

[Killed] ConditionalExpression
main/components/Commons/CommonsCard.js:45:41
                                 size="sm"
                                 className="mx-4"
                                 onClick={() => {
-                                    if (buttonText === "Join" && isFutureDate(commons.startingDate)) {
+                                    if (true && isFutureDate(commons.startingDate)) {
                                         // Stryker disable next-line all: unable to read alert text in tests
killedBy: HomePage tests Redirects to the PlayPage when you click visit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/play/1"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/Commons/CommonsCard.js:48:44
                                     if (buttonText === "Join" && isFutureDate(commons.startingDate)) {
                                         // Stryker disable next-line all: unable to read alert text in tests
-                                    } else {
-                                        buttonLink(commons.id);
-                                    }
+                                    } else {}
                                     }} >{buttonText}
                             </Button>
killedBy: HomePage tests Redirects to the PlayPage when you click visit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/play/1"

Number of calls: 0

<html>
  <head />
