[Killed] StringLiteral
main/components/Commons/CommonsList.js:6:60
 import { Card, Container, Row, Col } from "react-bootstrap";
 
 const CommonsList = (props) => {
-    const defaultMessage = props.title?.includes("Join") ? "join" : "visit";
+    const defaultMessage = props.title?.includes("Join") ? "" : "visit";
 
     return (
killedBy: CommonsList tests renders default join UI when there are no commons
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "There are currently no commons to join"
Received: "There are currently no commons to "

[Killed] ConditionalExpression
main/components/Commons/CommonsList.js:26:14
             >
                 {props.title}
             </Card.Title>
-            {props.commonList.length > 0 ? 
+            {true ? 
             <React.Fragment>
                 <Card.Subtitle>
killedBy: CommonsList tests renders default join UI when there are no commons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="commonsList-default-message"]

<body>
  <div>
    <div
      class="my-3 border-0 card"
      style="opacity: 0.9;"
    >

[Killed] EqualityOperator
main/components/Commons/CommonsList.js:26:14
             >
                 {props.title}
             </Card.Title>
-            {props.commonList.length > 0 ? 
+            {props.commonList.length >= 0 ? 
             <React.Fragment>
                 <Card.Subtitle>
killedBy: CommonsList tests renders default join UI when there are no commons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="commonsList-default-message"]

<body>
  <div>
    <div
      class="my-3 border-0 card"
      style="opacity: 0.9;"
    >
