[Killed] LogicalOperator
main/components/Commons/CommonsOverview.js:22:30
                     <Col className="text-start">
                         <div data-testid="announcement-test">
                             { /* Stryker disable all: announcements backend broken so testing by posting announcements does not work */ }
-                            {announcements && announcements.length > 0 ? (
+                            {announcements || announcements.length > 0 ? (
                                 announcements.map((announcement, index) => (
                                     <AnnouncementCard key={index} announcement={announcement} />
killedBy: CommonsOverview tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
main/components/Commons/CommonsOverview.js:22:30
                     <Col className="text-start">
                         <div data-testid="announcement-test">
                             { /* Stryker disable all: announcements backend broken so testing by posting announcements does not work */ }
-                            {announcements && announcements.length > 0 ? (
+                            {true ? (
                                 announcements.map((announcement, index) => (
                                     <AnnouncementCard key={index} announcement={announcement} />
killedBy: CommonsOverview tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Survived] ArrowFunction
main/components/Commons/CommonsOverview.js:23:51
                         <div data-testid="announcement-test">
                             { /* Stryker disable all: announcements backend broken so testing by posting announcements does not work */ }
                             {announcements && announcements.length > 0 ? (
-                                announcements.map((announcement, index) => (
-                                    <AnnouncementCard key={index} announcement={announcement} />
-                                ))
+                                announcements.map(() => undefined)
                             ) : (
                                 <p>No announcements available.</p>
