[Killed] ArrowFunction
src/main/pages/HomePage.js:28:31
     );
   // Stryker restore all
 
-  const objectToAxiosParams = (newCommonsId) => ({
-    url: "/api/commons/join",
-    method: "POST",
-    params: {
-      commonsId: newCommonsId
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   // Stryker disable all : it is acceptable to exclude useBackendMutation calls from mutation testing
killedBy: HomePage tests Calls the callback when you click join
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/HomePage.js:28:50
     );
   // Stryker restore all
 
-  const objectToAxiosParams = (newCommonsId) => ({
-    url: "/api/commons/join",
-    method: "POST",
-    params: {
-      commonsId: newCommonsId
-    }
-  });
+  const objectToAxiosParams = (newCommonsId) => ({});
 
   // Stryker disable all : it is acceptable to exclude useBackendMutation calls from mutation testing
killedBy: HomePage tests Calls the callback when you click join
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
src/main/pages/HomePage.js:30:13
 
   const objectToAxiosParams = (newCommonsId) => ({
     url: "/api/commons/join",
-    method: "POST",
+    method: "",
     params: {
       commonsId: newCommonsId
killedBy: HomePage tests Calls the callback when you click join
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/HomePage.js:61:36
   // Stryker restore all
 
   let navigate = useNavigate();
-  const visitButtonClick = (id) => { navigate("/play/" + id) };
+  const visitButtonClick = (id) => {};
 
   //create a list of commons that the user hasn't joined for use in the "Join a New Commons" list.
killedBy: HomePage tests Redirects to the PlayPage when you click visit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/play/1"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
src/main/pages/HomePage.js:67:69
   const commonsNotJoinedList = commonsNotJoined(commons, commonsJoined);
   
   return (
-    <div data-testid={"HomePage-main-div"} style={{ backgroundSize: 'cover', backgroundImage: `url(${Background})` }}>
+    <div data-testid={"HomePage-main-div"} style={{ backgroundSize: "", backgroundImage: `url(${Background})` }}>
       <BasicLayout>
       <Card data-testid= {"HomePage-intro-card"} style={{opacity: ".9" }}>
killedBy: HomePage tests Home page intro card has the correct styles applied
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundSize: cover;

[Killed] StringLiteral
src/main/pages/HomePage.js:67:23
   const commonsNotJoinedList = commonsNotJoined(commons, commonsJoined);
   
   return (
-    <div data-testid={"HomePage-main-div"} style={{ backgroundSize: 'cover', backgroundImage: `url(${Background})` }}>
+    <div data-testid={""} style={{ backgroundSize: 'cover', backgroundImage: `url(${Background})` }}>
       <BasicLayout>
       <Card data-testid= {"HomePage-intro-card"} style={{opacity: ".9" }}>
killedBy: HomePage tests renders without crashing when lists return empty list
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HomePage-main-div"]

<body>
  <div>
    <div
      data-testid=""
      style="background-size: cover; background-image: url(HomePageBackground-night.jpg);"
    >

[Killed] ObjectLiteral
src/main/pages/HomePage.js:69:57
   return (
     <div data-testid={"HomePage-main-div"} style={{ backgroundSize: 'cover', backgroundImage: `url(${Background})` }}>
       <BasicLayout>
-      <Card data-testid= {"HomePage-intro-card"} style={{opacity: ".9" }}>
+      <Card data-testid= {"HomePage-intro-card"} style={{}}>
       <div className= "text-center border-0 my-3">
               <h1 data-testid="homePage-title" className="animate-charcter" >Howdy Farmer {firstName}</h1>
killedBy: HomePage tests Home page intro card has the correct styles applied
statusReason: Error: expect(element).toHaveStyle()

- Expected

- opacity: 0.9;

[Killed] StringLiteral
src/main/pages/HomePage.js:77:107
         <Container>
           <Row>
             <Col sm><CommonsList commonList={commonsJoined} title="Visit A Commons" buttonText={"Visit"} buttonLink={visitButtonClick} /></Col>
-            <Col sm><CommonsList commonList={commonsNotJoinedList} title="Join A New Commons" buttonText={"Join"} buttonLink={mutation.mutate} /></Col>
+            <Col sm><CommonsList commonList={commonsNotJoinedList} title="Join A New Commons" buttonText={""} buttonLink={mutation.mutate} /></Col>
           </Row>
         </Container>
killedBy: HomePage tests Calls the callback when you click join
statusReason: Error: Unable to find an element by: [data-testid="commonsCard-button-Join-4"]

<body>
  <div>
    <div
      data-testid="HomePage-main-div"
      style="background-size: cover; background-image: url(HomePageBackground-night.jpg);"
    >
