[Killed] BlockStatement
src/main/pages/AdminListAnnouncementsPage.js:22:32
     );
     // Stryker restore all
 
-    const createButton = () => {
-        return (
-            <Button href={`/admin/announcements/${commonsId}/create`}
-            style={{ float: "right" }}
-            >
-                Create Announcement
-            </Button>
-        );
-    }
+    const createButton = () => {}
 
     return (
killedBy: AdminListAnnouncementsPage tests Renders Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Announcement/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
src/main/pages/AdminListAnnouncementsPage.js:24:27
 
     const createButton = () => {
         return (
-            <Button href={`/admin/announcements/${commonsId}/create`}
+            <Button href={``}
             style={{ float: "right" }}
             >
killedBy: AdminListAnnouncementsPage tests Renders Create Button for admin user
statusReason: Error: expect(element).toHaveAttribute("href", "/admin/announcements/1/create") // element.getAttribute("href") === "/admin/announcements/1/create"

Expected the element to have attribute:
  href="/admin/announcements/1/create"
Received:
  href=""

[Killed] StringLiteral
src/main/pages/AdminListAnnouncementsPage.js:25:29
     const createButton = () => {
         return (
             <Button href={`/admin/announcements/${commonsId}/create`}
-            style={{ float: "right" }}
+            style={{ float: "" }}
             >
                 Create Announcement
killedBy: AdminListAnnouncementsPage tests Renders Create Button for admin user
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
