[Killed] BlockStatement
main/components/Commons/CommonsTable.js:42:45
         navigate(route)
     }
 
-    const announcementsCallback = (cell) => {
-        navigate(`/admin/announcements/${cell.row.values["commons.id"]}`);
-    }
+    const announcementsCallback = (cell) => {}
 
     const columns = [
killedBy: Modal tests Clicking the announcements button opens the page for adminUser
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/admin/announcements/1"

Number of calls: 0

<html>
  <head />

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.js:47:9
     }
 
     const columns = [
-        {
-            Header: 'id',
-            accessor: 'commons.id', // accessor is the "key" in the data
-
-        },
+        {},
         {
             Header:'Name',
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:93:17
         },
         {
             Header:<span> Show <br /> Chat? </span>,
-            id: 'commons.showChat',
+            id: "",
             accessor: (row, _rowIndex) => String(row.commons.showChat)
         },
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrayDeclaration
main/components/Commons/CommonsTable.js:118:28
 
     const testid = "CommonsTable";
 
-    const columnsIfAdmin = [
-        ...columns,
-        ButtonColumn("Edit", "primary", editCallback, testid),
-        ButtonColumn("Delete", "danger", deleteCallback, testid),
-        ButtonColumn("Leaderboard", "secondary", leaderboardCallback, testid),
-        HrefButtonColumn("Stats CSV", "success", `/api/commonstats/download?commonsId=`, testid),
-        ButtonColumn("Announcements", "primary", announcementsCallback, testid),
-    ];
+    const columnsIfAdmin = [];
 
     const columnsToDisplay = hasRole(currentUser,"ROLE_ADMIN") ? columnsIfAdmin : columns;
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      role="table"
    >
      <table
