[Survived] ArrowFunction
src/main/pages/AdminCreateAnnouncementsPage.js:12:36
     const { commonsId } = useParams();
 
 
-    const objectToAxiosPutParams = (announcement) => ({
-        url: "/api/announcements/post",
-        method: "POST",
-        params: {
-            commonsId: announcement.commonsId,
-            startDate: announcement.startDate,
-            endDate: announcement.endDate,
-            announcementText: announcement.announcementText
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (announcement) => {

[Survived] StringLiteral
src/main/pages/AdminCreateAnnouncementsPage.js:13:14
 
 
     const objectToAxiosPutParams = (announcement) => ({
-        url: "/api/announcements/post",
+        url: "",
         method: "POST",
         params: {

[Survived] BlockStatement
src/main/pages/AdminCreateAnnouncementsPage.js:23:41
         }
     });
 
-    const onSuccess = (announcement) => {
-        toast(`Announcement created - id: ${announcement.id}`);
-    }
+    const onSuccess = (announcement) => {}
 
     const mutation = useBackendMutation(

[Survived] BlockStatement
src/main/pages/AdminCreateAnnouncementsPage.js:36:38
 
     const { isSuccess } = mutation
 
-    const onSubmit = async (data) => {
-        mutation.mutate({ ...data, commonsId });
-    }
+    const onSubmit = async (data) => {}
 
     if (isSuccess) {

[Survived] ObjectLiteral
src/main/pages/AdminCreateAnnouncementsPage.js:37:25
     const { isSuccess } = mutation
 
     const onSubmit = async (data) => {
-        mutation.mutate({ ...data, commonsId });
+        mutation.mutate({});
     }
 

[Survived] BlockStatement
src/main/pages/AdminCreateAnnouncementsPage.js:40:20
         mutation.mutate({ ...data, commonsId });
     }
 
-    if (isSuccess) {
-        return <Navigate to="/admin/announcements/${commonsId}" />
-    }
+    if (isSuccess) {}
 
     return (
