[Killed] LogicalOperator
main/components/Announcement/AnnouncementCard.js:33:10
         return null;
     }
 
-    if ( announcement.endDate && (!isFutureDate(announcement.endDate))) {
+    if ( announcement.endDate || !isFutureDate(announcement.endDate)) {
         return null;
     }
killedBy: AnnouncementCard tests renders without crashing
statusReason: TypeError: Cannot read properties of null (reading 'substring')

[Killed] StringLiteral
main/components/Announcement/AnnouncementCard.js:42:47
         style={{ fontSize: "14px", border: "1px solid lightgrey", padding: "4px", borderRadius: "10px", margin: "10px 0" }}>
             <Container>
                 <Row>
-                    <Col xs={12} data-testid={`${testIdPrefix}-id-${announcement.announcementText}`}>
+                    <Col xs={12} data-testid={``}>
                         <div
                             // Stryker disable next-line all : don't mutation test CSS
killedBy: AnnouncementCard tests renders with correct data-testid
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="announcementCard-id-This is a test announcement for commons id 1. This one doesn't have an end date."]

<body>
  <div>
    <div
      class="card-body"
      style="font-size: 14px; border: 1px solid lightgrey; padding: 4px; border-radius: 10px; margin: 10px 0px;"
    >
