[Killed] BlockStatement
main/components/Users/UsersTable.js:10:38
 
     const navigate = useNavigate();
 
-    const suspendCallback = (row) => { 
-        console.log(row)
-        navigate(`/admin/suspend/user/${row.row.values.id}`)
-    }
+    const suspendCallback = (row) => {}
 
     const columns = [
killedBy: UserTable tests Suspend button calls suspend callback
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/admin/suspend/user/1"

Number of calls: 0

<html>
  <head />
