[Killed] BlockStatement
src/main/pages/AdminSuspendUserPage.js:4:36
 import React from "react";
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-const AdminSuspendUserPage = () => {
-
-   // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Suspend User page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  )
-};
+const AdminSuspendUserPage = () => {};
 
 export default AdminSuspendUserPage;
killedBy: AdminSuspendUserPage tests Renders expected content
statusReason: Error: AdminSuspendUserPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
